//#include <stdio.h>
//
//int main()
//{
//    int coding = 0;
//    printf("你会去敲代码吗？（选择1 or 0）:>");
//    scanf_s("%d", &coding);
//    if(coding == 1)
//   {
//       printf("坚持，你会有好offer\n");
//   }
//    else
//   {
//       printf("放弃，回家卖红薯\n");
//   }
//    return 0;
//}
/*

你会去敲代码吗？（选择1 or 0）:>1
坚持，你会有好offer

你会去敲代码吗？（选择1 or 0）:>0
放弃，回家卖红薯

*/

/*

if或者else条件后面只有一条语句时,花括号可写可不写，不加的话记得缩进，为了美观和规范，一般写上。

一个if对应一个else，需要注意配对。
在编写代码的时候，如果使用的if-else较多，应当注意添加相应的花括号，增加代码的可读性。
在使用了if以后，如果不需要另外的条件判断，就可以不使用else。
当括号较多时，通常在右括号}后面注释上是属于哪段的括号，以免混淆。

*/