//一些for循环的变种

//变种1
/*
	1.for循环的初始化、调整、判断都可以省略
		但是∶
		for循环的额判断部分如果被省略,那判断条件就是:恒为正
	2.如果不是非常熟练，建议不要随便省略

*/
//以下代码出现死循环
//#include <stdio.h>
//
//int main()
//{
//	for (;;)
//	{
//		printf("hehe\n");
//	}
//
//	return 0;
//}


//#include <stdio.h>
//
//int main()
//{
//	int i = 0;
//	int j = 0;
//
//	//代码只打印10次 hehe ，因为j = 10(停止循环)回到第一个循环，
//	//第一个循环进行判断成立，继续执行第二个循环
//	//因为j在上一次循环已经等于10，并且第二个循环没有对j进行初始化
//	//所以判断j = 10 不小于 10，判断不成立，循环不执行
//	for (; i < 10; i++)
//	{
//		for (; j < 10; j++)
//		{
//			printf("hehe\n");//0 1 2 3 3 4 5 6 7 8 9 j = 10(停止循环)
//		}
//	}
//
//	return 0;
//}




////变种2
//#include <stdio.h>
//
//int main()
//{
//	int x, y;
//
//	//第一次判断：x = 0,y = 0， x < 2 && y < 5判断成立，执行循环
//	//第一次判断：x = 1,y = 1， x < 2 && y < 5判断成立，执行循环
//	//第一次判断：x = 2,y = 2， x < 2 && y < 5判断不成立，不执行循环
//	//因为&&：短路与，表示如果两个条件都成立则执行之后的逻辑
//	//所以因为x=2，x<2的条件不成立，循环不执行
//	for (x = 0, y = 0; x < 2 && y < 5; ++x, y++)
//	{
//		printf("hehe\n");
//	}
//
//	return 0;
//}



////请问循环要循环多少次?
////循环0次，因为for循环的判断处事0赋值给k
////k恒为0，0为假，则循环条件不成立，循环0次
//#include <stdio.h>
//
//int main()
//{
//	int i = 0;
//	int k = 0;
//	for (i = 0, k = 0; k = 0; i++, k++)
//		k++;
//
//	return 0;
//}